 function ret= Net_Esitmate(Data,Data_origin,flag,NLAGS)
 % 赖琴
Defined_GC = [
        NaN   0   0   1   0   0
          1 NaN   0   0   0   0
          0   1 NaN   0   0   0
          1   0   1 NaN   0   0 
          0   0   0   1 NaN   1 
          1   0   0   0   0 NaN];
% DLap
% Defined_GC = [0,0,0,0,0;1,0,1,0,0;1,1,0,0,0;1,0,0,0,1;0,0,0,1,0];
% Lapps
% Defined_GC = [0,0,0,0,0,0,0,1
%               1,0,0,0,0,0,0,0
%               0,0,0,1,0,0,0,0
%               0,0,0,0,1,0,0,1
%               0,0,0,0,0,1,0,0
%               0,0,0,0,1,0,1,0
%               0,0,0,0,0,0,0,1
%               0,0,0,0,0,0,0,0];



% 自己的仿真模型
% Defined_GC = [
%         NaN   0   0   1   0   0
%           1 NaN   1   0   0   0
%           1   1 NaN   0   0   0
%           1   0   1 NaN   0   0 
%           1   0   0   1 NaN   1 
%           1   0   0   0   0 NaN];


% 自己的仿真模型（2）
% Defined_GC = [
%         NaN   0   0   0   1   0
%           1 NaN   1   0   0   0
%           0   1 NaN   0   0   0
%           0   0   1 NaN   0   0 
%           0   0   0   1 NaN   1 
%           1   0   0   0   0 NaN];

% 自己的仿真模型（3）
% Defined_GC = [
%         NaN   0   0   0   1   0
%           1 NaN   1   0   0   0
%           0   1 NaN   0   0   0
%           0   1   1 NaN   0   0 
%           0   0   0   1 NaN   1 
%           1   0   0   0   0 NaN];


% At为模拟的MVAR参数（存在问题） 
% 赖琴
At = zeros(18,6);
At(1,1) = 0.22;
At(10,1) = 0.56;
At(1,2) = 0.55;
At(2,2) = -0.22;
At(14,3) = 0.48;
At(7,4) = 0.51;
At(15,4) = 0.85;
At(4,5) = 0.42;
At(12,5) = 0.40;
At(7,6) = 0.65;

% DLap
% At = zeros(15,5);
% At(1,1) = 1.3435;
% At(6,1) = -0.9025;
% At(6,2) = 0.5;
% At(7,2) = -0.4;
% At(7,3) = 0.4;
% At(11,3) = -0.4;
% At(4,4) = 0.25.*sqrt(2);
% At(6,4) = 0.25.*sqrt(2);
% At(6,4) = -0.5;
% At(4,5) = -0.25.*sqrt(2);
% At(5,5) = 0.25.*sqrt(2);
% Lapps
% At = zeros(6*8,8);
% At(1,1) = 0.3;
% At(8,1) = 0.4;
% At(16,1) = -0.55;
% At(24,1) = 0.4;
% At(1,2) = 0.5;
% At(2,2) = 0.6;
% At(10,2) = 0.4;
% At(3,3) = 0.25;
% At(4,3) = 0.5;
% At(12,3) = 0.7;
% At(19,3) = -0.25;
% At(20,3) = -0.4;
% At(5,4) = 0.25;
% At(8,4) = 0.32;
% At(13,4) = -0.5;
% At(16,4) = 0.25;
% At(24,4) = 0.5;
% At(5,5) = 0.25;
% At(6,5) = 0.25;
% At(13,5) = -0.25;
% At(14,5) = -0.5;
% At(5,6) = -0.25;
% At(7,6) = 0.41;
% At(13,6) = 0.25;
% At(15,6) = 0.25;
% At(23,6) = 0.25;
% At(7,7) = 0.2;
% At(8,7) = 0.31;
% At(15,7) = -0.5;
% At(16,7) = 0.25;
% At(24,7) = -0.5;
% At(8,8) = 0.25;
% At(16,8) = 0.25;
% At(24,8) = 0.33;
% At(32,8) = 0.25;
% At(48,8) = -0.25;

% 自己的仿真实验
% At = zeros(18,6);
% At(1,1) = 0.3;
% At(10,1) = 0.67;
% At(1,2) = 0.8;
% At(2,2) = -0.5;
% At(15,2) = 0.7;
% At(7,3) = 0.31;
% At(14,3) = 0.45;
% At(7,4) = 0.71;
% At(15,4) = 0.57;
% At(4,5) = 0.83;
% At(12,5) = 0.61;
% At(13,5) = 0.73;
% At(7,6) = 0.49;

% 自己的仿真实验（2）
% At = zeros(18,6);
% At(1,1) = 0.3;
% At(11,1) = 0.67;
% At(1,2) = 0.8;
% At(2,2) = -0.5;
% At(15,2) = 0.7;
% At(14,3) = 0.45;
% At(15,4) = 0.57;
% At(4,5) = 0.83;
% At(12,5) = 0.61;
% At(7,6) = 0.49;


% 自己的仿真实验（3）
% At = zeros(18,6);
% At(1,1) = 0.3;
% At(11,1) = 0.67;
% At(1,2) = 0.8;
% At(2,2) = -0.5;
% At(15,2) = 0.7;
% At(14,3) = 0.45;
% At(2,4) = 0.79;
% At(15,4) = 0.57;
% At(4,5) = 0.83;
% At(12,5) = 0.61;
% At(7,6) = 0.49;
ret = GrangerNet_Estimate(Data,flag,NLAGS);
% 计算参数估计偏差
bia = norm(At-ret.MVAR,1)/norm(At,1);
ret.bia = bia;

% 计算正确恢复的连接数目
Estimate_GC = ret.gc_by;
ret.Rnum = GC_change(Defined_GC,Estimate_GC);


% 在ret中加入原始未加异常值的Y_origin
for ii=1:size(Defined_GC,2)
    xvec = Data_origin(ii,:)';
    xdep = xvec(NLAGS+1:end);
    % 不含异常值的原始Y
    y_origin(:,ii) = xdep;
end
ret.y_origin = y_origin;